<template>
  <v-container>

    <v-carousel cycle height="400"
                hide-delimiter-background
                show-arrows-on-hover>

      <v-carousel-item v-for="(item, i) in slides"
                       :key="i">
        <v-sheet :color="item.color"
                 height="100%">
          <v-row class="fill-height"
                 align="center"
                 justify="center">
            <div class="text-h2">
              {{ item.text }} Slide
            </div>
          </v-row>
        </v-sheet>
      </v-carousel-item>
    </v-carousel>


    <!--  todo Техническое задание:
            Для Jobs, сделать страницы:
            =========================
            - Главная
            - Каталог заданий
            - Страница с заданием
            - Страница с листом заданий, которые нужно выполниить
            - Страница создания задания
            - Страница выполнения задания
            =========================
            Главная страница:
            Данная страница является лендингом, которая сообщает:
            - что это за проект (имеется ввиду что такое Jobs (пока Jobs, потом придумается под другое название))
            - что можно на нём делать (работать, давать работы, и так далее),
            - поиск по заданиям
            - выводит топы выполненных
            - (подумается)
            .
            =========================
            Каталог заданий:
            _______________
            Каталог представляет из себя лист заданий, с возможностью фильтрации.
            Особенности :
            - Карточка с заданием должна содержать в себе:
            -- Картинку (не обязательное)
            -- Название (что нужно сделать)
            -- Цена заказа
            -- Время выполнения
            -- Кто заказчик
            -- Кол-во откликов
            - Должна быть менюшка, в которой есть пункты:
            -- Пожаловаться
            -- Добавить в изобранное
            - Кнопки
            -- Откликнуться
            При клике на название, происходит переход на страницу с заданием
            Карточка должна быть вынесена в отдельный компонент
            .
            =========================
            Страница с заданием:
            ___________________
            На данной странице располагается:
            - Картинка (не обязательна)
            - Название
            - Подробное описание
            - Цена заказа
            - Время выполнения
            - Кто заказчик
            - Кол-во откликов
            - Оставить отклик
            .
            =========================
            Страница выполнения задания:
            ___________________
            Данная страница должна иметь хэш, по виду
            /jobs/..../performance?task=lkwiod1w90j1mkjsaciasimooii09opjpo01-32i1203i012ij
            Во время загрузки, страница будет делать запрос и во время загружать скелетон.
            По хэшу task=... будет искаться задание, и система проверяет, есть ли доступ к данному заданию у
            конкретного человека, если нет, то будет высвечиваться соответсвтующее диалоговое окно, и предлагать
            перейти пользователю на главную страницу Jobs
            Так же, на этой странице, исполнитель, видит время выполнения, и может заполнять прогресс, который так же будет
            отражаться и у заказчика.
            .
            =========================
            Страница с листом заданий, которые нужно выполниить.
            ___________________
            Данная страница, доступна только для исполнителей, т.е. учеников.
            Здесь расположен список его заданий, которые он должен так или иначе выполнить.
            При клике на задание, оно перекидывает на страницу выполнения задания

            Т.З. дописывается, идите нахкмй

      -->

    <jobs-professions/>
  </v-container>
</template>
<script lang="ts">
import {Component, Vue} from "vue-property-decorator"
@Component ({
  layout: 'jobs'
})
export default class Jobs extends Vue {
  slides: any =[
    {
      color: 'indigo',
      text: 'First',
    },
    {
      color: 'warning',
      text: 'Second',
    },
    {
      color: 'pink darken-2',
      text: 'Third',
    },
    {
      color: 'red lighten-1',
      text: 'Fourth',
    },
    {
      color: 'deep-purple accent-4',
      text: 'Fifth',
    },
  ]

}
</script>

